FILES/InformationRegisters/ФайлыДляОтправкиВОблако.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ФайлыДляОтправкиВОблако</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>md5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВложенныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ЗагрузкиВОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЗагрузкиВОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗагрузокУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUIDФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/CommonForms/ВыборВариантаЗагрузки/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ФайлыВыборСервер(Объект, GUIDФайла)
	
	Адрес = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФайлыДляОтправкиВОблако.Период,
	               |	ФайлыДляОтправкиВОблако.GUID,
	               |	ФайлыДляОтправкиВОблако.Объект,
	               |	ФайлыДляОтправкиВОблако.ИмяФайла,
	               |	ФайлыДляОтправкиВОблако.Отправлено,
	               |	ФайлыДляОтправкиВОблако.ДД,
	               |	ФайлыДляОтправкиВОблако.md5,
	               |	ФайлыДляОтправкиВОблако.ТипВложения
	               |ИЗ
	               |	РегистрСведений.ФайлыДляОтправкиВОблако КАК ФайлыДляОтправкиВОблако
	               |ГДЕ
	               |	ФайлыДляОтправкиВОблако.md5 = &md5
	               |	И ФайлыДляОтправкиВОблако.Объект = &Объект";
	Запрос.УстановитьПараметр("md5", GUIDФайла);
	Запрос.УстановитьПараметр("Объект",Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДД = УправлениеБТВызовСервера.ПолучитьФайлИзОблака(Выборка.md5);
		Адрес = ПоместитьВоВременноеХранилище(ДД);		
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура СписокЗагрузокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Адрес = ФайлыВыборСервер(СсылкаНаОбъект, Элемент.ТекущаяСтрока.GUIDФайла);			
	Если ЗначениеЗаполнено(Адрес) Тогда 
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		HttpБуфер = Новый HTTPЗапрос;
		HttpБуфер.УстановитьТелоИзДвоичныхДанных(ДД);
		СтрокаСодержимое = HttpБуфер.ПолучитьТелоКакСтроку();
		
		Если Элемент.ТекущиеДанные.ИмяФайла = "json.file" Тогда
			//
			СтруктураЖСОН = УправлениеБТВызовСервера.ИзJSON(СтрокаСодержимое);
			//ЧтениеJSON = Новый ЧтениеJSON; 
			//ЧтениеJSON.УстановитьСтроку(СтрокаСодержимое);
			//СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
			//ЧтениеJSON.Закрыть();
			
			СтрокаСодержимое = УправлениеБТВызовСервера.ВJSON(СтруктураЖСОН);
			//ЗапистьJSON = Новый ЗаписьJSON;
			//ЗапистьJSON.УстановитьСтроку();
			//ЗаписатьJSON( ЗапистьJSON, СтруктураЖСОН);
			//СтрокаСодержимое = ЗапистьJSON.Закрыть();				
		КонецЕсли;
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(СтрокаСодержимое);
		Текст.Показать(Элемент.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаОбъект = Неопределено;
	ЭтаФорма.Параметры.Свойство("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Если СсылкаНаОбъект <> Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗагрузкиВОбъекты.НастройкаЗагрузки КАК НастройкаЗагрузки,
		               |	ЗагрузкиВОбъекты.GUIDФайла КАК GUIDФайла,
		               |	ЗагрузкиВОбъекты.ДатаЗагрузки КАК ДатаЗагрузки,
		               |	ЗагрузкиВОбъекты.Объект КАК Объект
		               |ПОМЕСТИТЬ ВОбъектах
		               |ИЗ
		               |	РегистрСведений.ЗагрузкиВОбъекты КАК ЗагрузкиВОбъекты
		               |ГДЕ
		               |	ЗагрузкиВОбъекты.Объект = &Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВОбъектах.НастройкаЗагрузки КАК НастройкаЗагрузки,
		               |	ВОбъектах.GUIDФайла КАК GUIDФайла,
		               |	ВОбъектах.ДатаЗагрузки КАК ДатаЗагрузки,
		               |	МАКСИМУМ(ФайлыДляОтправкиВОблако.ИмяФайла) КАК ИмяФайла
		               |ИЗ
		               |	ВОбъектах КАК ВОбъектах
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыДляОтправкиВОблако КАК ФайлыДляОтправкиВОблако
		               |		ПО ВОбъектах.GUIDФайла = ФайлыДляОтправкиВОблако.md5
		               |			И ВОбъектах.Объект = ФайлыДляОтправкиВОблако.Объект
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВОбъектах.НастройкаЗагрузки,
		               |	ВОбъектах.GUIDФайла,
		               |	ВОбъектах.ДатаЗагрузки";
		Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		СписокЗагрузок.Загрузить(Выгрузка);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗагрузкаДанных(Файл, СсылкаНаОбъект, НастройкаЗагрузки)
	
	УправлениеБТСервер.ЗагрузитьДанныеВУслугу(Файл, СсылкаНаОбъект, НастройкаЗагрузки);
	
КонецФункции

&НаКлиенте
Процедура СписокЗагрузокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СокрЛП(Элемент.ТекущиеДанные.Файл) <> "" Тогда
		ТД = Элемент.ТекущиеДанные;
		ИсхСтруктура = Новый Структура("ИсходнаяМаска, ИмяФайла", ТД.Файл, ТД.ИмяФайла);
		ЗагрузкаДанных(ИсхСтруктура, СсылкаНаОбъект, ТД.НастройкаЗагрузки);
		
		Оповестить("ИзменениеУслуги", СсылкаНаОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗагрузокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		Адрес = ФайлыВыборСервер(СсылкаНаОбъект, Элемент.ТекущиеДанные.GUIDФайла);			
		Если ЗначениеЗаполнено(Адрес) Тогда 
			ДД = ПолучитьИзВременногоХранилища(Адрес);
			СтрокаСодержимое = "";
			Если ДД <> Ложь Тогда 
				HttpБуфер = Новый HTTPЗапрос;
				HttpБуфер.УстановитьТелоИзДвоичныхДанных(ДД);
				СтрокаСодержимое = HttpБуфер.ПолучитьТелоКакСтроку();
			КонецЕсли;	
			Элемент.ТекущиеДанные.Файл = СтрокаСодержимое; 
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
